[{"_id":"rec1ODlOJl25MTTgP","Talk":"BigQuery and Cloud Machine Learning","Tags":["machine-learning","cloud"],"Year":"2017","Speakers":["recFAamweu9y7LEKB"]},{"_id":"rec2ntYkBjWpdK14X","Talk":"Messaging for the cloud","Tags":["cloud","messages"],"Year":"2017","Speakers":["recZc8742BSsZjo9Y"]},{"_id":"rec332x5PkgCT6FEE","Talk":"Let your users decide what they want","Description":"We are all working towards one single goal. To create a best user experience. But most of the time we are wrong about what we think is good for the user. We usually have no idea if a feature is useful to the user until it is used by the customers.\n\nMy talk is about letting the users help you understand what they need and if a particular feature is really useful for the users by using the technique of A/B testing. At Booking.com we are constantly running A/B tests to improve the customer experience by measuring the business metrics.\n\nAudience attending my talk would learn how to run A/B tests in their company at scale and what it takes to build the optimal tests.","Tags":["ux","test"],"Year":"2018","Speakers":["recCEJddNjH79b9wj"]},{"_id":"rec3Rynq40nBCOfV4","Talk":"Idea to Execution and Beyond","Description":"A high-level run-through of what it takes to execute and launch a project. Ashley covers the idea stage, build process, launch, and what to expect post-launch. Idea validation, shipping anxiety, and customer development are just a few of the themes covered.","Tags":["startups","project-management"],"Year":"2018","Speakers":["recf8vdgREYlYWNtv"],"Rating":2},{"_id":"rec5EdsR5Ta3PEDcH","Talk":"How to Avoid Creating a GitHub Junkyard","Tags":["engineering"],"Year":"2017","Speakers":["recTif3xRuow4sfpw"]},{"_id":"rec5XDnJJRfYwCD2M","Talk":"Build a 12-factor microservice with MicroProfile","Description":"Planning to build microservices? The best practice of building a first-class microservice is to follow 12-Factor app. But how to fulfill the 12-factor app rules, e.g. how to achieve externalise the configuration, fault tolerance, etc? Come to this session to build a 12-factor microservice using MicroProfile programming mode in half an hour with live code demo.","Tags":["microservices"],"Year":"2018","Speakers":["rec3ZMLvQKU424zIq"]},{"_id":"rec5lm7g7nk4JoqBf","Talk":"Beyond Connected Car","Tags":["iot"],"Year":"2017","Speakers":["rec5ht6YMLBw9BXAm","recBTu0Y77vJ786Fc"]},{"_id":"rec6VGbmRjcvIBaUF","Talk":"Engineers and Writers – The Documentation Tango","Description":"Developing and documenting a product is like a complicated dance where both sides think to lead. This presentation focuses on how authors and engineers interact. It will focus on ways to improve development cycles without sending both sides off the dance floor. It includes:\n\n+ Examining the relationship between engineer and writer\n+Navigating best practices for maximum output\n+ The Frustration Factor\n+ Seeking Resolution\n\nParticipants will leave the session with some practical ideas for improving their workflow and a better understanding of the engineer-writer relationship and, using some humor, will end with suggestions for getting the development and documentation teams to dance to the tune and sing with the choir.","Tags":["dev","documentation"],"Year":"2018","Speakers":["recvJqLQ8UqQqvasK"]},{"_id":"rec6bJoetc8wzLwfc","Talk":"How not to do DevOps","Tags":["devops"],"Year":"2017","Speakers":["recoJ2uhwI5v7wACK"]},{"_id":"rec7oe3WJJtvdB50x","Talk":"Javascript without Javascript","Description":"With the help of a handful of amazing open source programs, we can now transpile nearly any programming language to JS, making it a sort of modern assembly language. In a fun and code heavy talk, I’ll show how you can leverage pre existing libraries today in order to get amazing performance and features in your current web apps, creating possibilities you never dreamt possible in the web browser. To top it off, a sneak peek into what the future of web perf will look like.","Tags":["javascript","dev"],"Year":"2018","Speakers":["recMush45t6QUo047"]},{"_id":"rec7zCSHEcuYTFPHU","Talk":"Making Java more dynamic","Description":"Use of runtime code generation in the Java ecosystem, how it is used by frameworks like Spring and Hibernate and how to develop Java agents.","Tags":["java"],"Year":"2017","Speakers":["recUPmiWnpQPrDDni"]},{"_id":"rec8A8RBrt2ZVr6Qv","Talk":"Enhance! Deploying Image Recognition with TensorFlow and Kubernetes","Tags":["containers","machine-learning"],"Year":"2017","Speakers":["rec5bg1As40D5LQBD"]},{"_id":"recAmMSsMb3B2mrJ0","Talk":"How we process billions of metrics to make your microservices run smoothly","Description":"why stream based analytics are important\nour metadata model\nour architecture\ntechnical details","Tags":["java"],"Year":"2017","Speakers":["recp1To9NAzpo4G71"]},{"_id":"recAxWGKTlrIQ84Fg","Talk":"How to Design and Build Chatbots that People will Love!","Tags":["ux"],"Year":"2017","Speakers":["recWxJEuDx9Sj8oBD"]},{"_id":"recBzKO8D2rkbhivn","Talk":"Use of JHipster in building next-gen Devops intelligence","Description":"This talk will focus on the experience of using JHipster in building the newest DevOps product from XebiaLabs. I will talk about the architecture, how JHipster is used and about some issues faced and how we overcome them.","Tags":["java","dev"],"Year":"2018","Speakers":["recmIQo53V0Bykzak"]},{"_id":"recEVSHuBt0ahCbva","Talk":"Android Typography","Description":"Tips and tricks for using and formatting text on Android platform. How to layout text to align with designs, what certain design terms regarding text mean and how to apply them on Android. Pros and cons of certain approaches regarding both code readability and performance.\n","Tags":["mobile","ux","android"],"Year":"2018","Speakers":["recoNnLhGUsYzLNlq"]},{"_id":"recFqoN3NO9aVYRlu","Talk":"Software Aging - Why it happens and how to reduce it","Description":"Programs, like people, get old. After they are delivered to customers, various factors make the software become hard to change, slow, and \"old fashioned”.  This increases costs for the vendor and eventually will drive the product from the market. Many companies become non-competitive as a result of their product ageing. \nWe can’t prevent software ageing, but we can understand its causes, take steps to limit its effects, temporarily reverse some of the damage it has caused, and prepare for the day when the software is no longer viable. A sign that the Software Engineering profession has matured will be that we lose our preoccupation with the first release and focus on the long term health of our products. Researchers and practitioners must change their perception of the problems of software development. Only then will Software Engineering deserve to be called Engineering.","Tags":["engineering"],"Year":"2017","Speakers":["recQFMByRK4oTK2rC"],"Rating":3},{"_id":"recGhaHHiFFLIHjAh","Talk":"Resilient Architectures","Description":"\"Slides: https://www.slideshare.net/mstine/resilient-architecture\nDemo Video: https://www.youtube.com/watch?v=jNMbzWDynLk&feature=youtu.be\"","Year":"2017","Speakers":["reczhnIiRXVsj7wf9"]},{"_id":"recI6m1KurfC7Qwju","Talk":"Improving your Git workflows","Description":"Almost everybody uses Git nowadays. But how many people actually know how Git works internally? It is powerful, but extremely confusing.\n\nIn this talk, I’ll would explain how Git works internally and provide useful tips and tricks for improving developer productivity.","Tags":["dev"],"Year":"2018","Speakers":["recJJZkv8aJhdapwT"]},{"_id":"recI7ltcIiWAHP3CT","Talk":"Serverless: The Missing Manual","Description":"Do serverless cloud platforms leave you with more questions than answers? This session will focus on migrating from traditional applications to serverless cloud platforms.\n\nYou’ll learn about serving files without a web server, managing application state in a stateless environment, running background processes in ephemeral runtimes and more. These techniques will enable you to build modern applications using serverless platforms.\n\nThis session is for developers who see the benefits of serverless but are struggling to adjust to a serverless world.","Tags":["serverless","cloud"],"Year":"2018","Speakers":["recLrQTVuKMNOcDxs"]},{"_id":"recIT5XEzLvHnjPSL","Talk":"Unified User Experience for next generation trading systems","Description":"How to unify a complex trading solution to create a first class user experience for asset managers, portfolio managers and risk managers.","Tags":["ux"],"Year":"2018","Speakers":["recbLIJWqDxnJLOUl"]},{"_id":"recIWdvu8y7B93hLQ","Talk":"VR application in teleconferencing","Tags":["vr/ar"],"Year":"2017","Speakers":["rec2QYXWl8I0jsDhd"]},{"_id":"recJ1v7pXB3rQBW4O","Talk":"Thinking Reactive while writing JavaScript","Tags":["javascript","web"],"Year":"2017","Speakers":["recL5Xj63TM90DQeS"]},{"_id":"recJNe0UJ4Oq13nbV","Talk":"Resilient microservices with Kubernetes","Description":"You can see my slides here: https://t.co/qucN1W4FCB","Tags":["containers","microservices"],"Year":"2017","Speakers":["recF6GFrK0wg6wg5v"]},{"_id":"recJU27ecfsCohVcH","Talk":"Going Web Native","Description":"How your next native app might be a web app, can the browser be the new operating system, or is there something missing? Have we reached the peak performance yet? Let’s discuss everything from web assembly, progressive web apps, and web components which are the building blocks for native web apps.","Tags":["dev"],"Year":"2018","Speakers":["recU9yljOydF0ii15"]},{"_id":"recJb2F9tJL0rMp7O","Talk":"Pain-free migration to Angular 4","Tags":["web","javascript"],"Year":"2017","Speakers":["recdoPJ4xy0v6iIqB","recIj7PMOFoHWbTLg"]},{"_id":"recJmu5BSw9kn66fQ","Talk":"Serverless Java in action with Fn!","Description":"Serverless computing and FaaS (Function as a Service) are the new blacks! They radically change how software is organized, deployed, and charged for.\n\nThis hands-on session will introduce you to Fn Project, an open source FaaS platform. And although Fn is by design polyglot (ex. Go & JavaScript), we will mostly focus on Java and related JVM topics (ex. Spring Cloud Function, Serverless Kotlin). We will also discuss an functions orchestration using the Fn Flow API, a distributed Promise based API, to compose multiple functions into meaningful applications.\n\nAttend this session to see that Java is not antinomic to Serverless!","Tags":["serverless","java"],"Year":"2018","Speakers":["rec0sljvDaOpDG63O"]},{"_id":"recKNpAfP5bB4g7zK","Talk":"Changing wheels on moving car, from monolith to microservices by using API's","Description":"Refactoring and changing\ntalk/discussion about refactoring and changing code, why we do it, what are reasons behind it, and also funny history of IT predictions\nDangers and how to avoid them\nHow api's can help - how we can use api's and how they should be used. How to refactor monolith to microservices and how to use api's for this ","Tags":["microservices"],"Year":"2017","Speakers":["rec5oxBy62dcMfYeh"]},{"_id":"recKtwxlFFN1IZ5wX","Talk":"ECLIPSE MICROPROFILE: ACCELERATING THE ADOPTION OF JAVA MICROSERVICES","Description":"\"MicroProfile overview\nMicroProfile Config \nMicroProfile fault tolerance","Tags":["microservices"],"Year":"2017","Speakers":["rec3ZMLvQKU424zIq"]},{"_id":"recNcQ1qR03bOJ604","Talk":"An introduction to Deep Learning","Tags":["machine-learning"],"Year":"2017","Speakers":["recLf6FdUOu8h9xbU"]},{"_id":"recO0ye1Xi3deCj8J","Talk":"Going Reactive with Spring 5 & Project Reactor","Tags":["dev"],"Year":"2017","Speakers":["recf2FsuOWXxqE4Xm"]},{"_id":"recQEWDNAgu6UZBCF","Talk":"On the Engineering of Software-Based Systems for the 21 st Century","Tags":["engineering"],"Year":"2017","Speakers":["recjiTpJvkB8fCxX9"]},{"_id":"recQkmTbi90kKu9ew","Talk":"UX meets Security","Tags":["ux","security"],"Year":"2017","Speakers":["rec35uykbmg0Mfsc2"]},{"_id":"recRLsJyXvfXPx86Z","Talk":"Escaping Developer Nightmares","Description":"Have you ever worked on a legacy project, like lots of source code, but no unit tests? Or no continuous delivery? Static code analysis completely missing, or even a simple code standard totally absent?\n\n\nProjects like these are still more often the case than we like to think. In fact, maybe you are a developer stuck in such a project, even though you have tried to raise these issues as problems? Were you told that is gold-plating, or simply too much work to fix?\n\nI would like to share my experiences from a couple of such projects, both from the perspective of a tech lead in a project like this, and as a software reviewer (i.e. doing software auditing). But most important: I would like to help you with some good arguments, to convince your project leader why these things matter.","Tags":["dev"],"Year":"2018","Speakers":["recRV71hCYRqfS28a"]},{"_id":"recRZ5TP2BudMCXos","Talk":"It’s My (Third) Party and I'll Cry If I Want To","Description":"Like it or not, a huge part of modern web development involves the use of third-party providers: fonts, analytics, ads, tracking, and more all have an impact of performance, and can leave us (or, more worryingly, our visitors) susceptible to performance degradation.\n\nIn this talk, we’ll take a look at unruly or uninvited (third-)party guests: how to detect them, how to audit them, and how to manage them. We’ll also look at the different tools available to help us stress-test and quantify the overhead these third parties bring, and what that means for users and businesses alike.","Tags":["dev"],"Year":"2018","Speakers":["rec53EA85ic2A2IhW"]},{"_id":"recTQgVrowfWV4mXc","Talk":"Continuous Deployment for Mission Critical Infrastructures","Description":"Imagine one hour without internet, telephony, SMS - the world would feel like it stopped turning. Communication infrastructures are one of the critical infrastructures these days, fueling not only any businesses but with the rise of social networks also our society. Mobile Network Operators are the key customers for LotusFlare, demanding for more agility and moving at the speed of hyperscale OTT players while providing these critical parts of our infrastructure. We will talk about challenges and how we help mobile operators in their transformation to fast moving engaging experience providers.","Tags":["infrastructure"],"Year":"2018","Speakers":["rec7cXNYdAmbRzbut"]},{"_id":"recTgdZ4C9OrkuWe7","Talk":"GraphQL at Product Hunt","Tags":["nosql"],"Year":"2017","Speakers":["recJJZkv8aJhdapwT"]},{"_id":"recUCpZjLtXUmlU4u","Talk":"Wifi Security, or Lack Thereof","Description":"\"* Introduction to different hacking techniques\n* Some theory around that\n* Some information about wifi package types\n* Practical demo example (live)\"","Tags":["mobile"],"Year":"2017","Speakers":["recRV71hCYRqfS28a"]},{"_id":"recVD7ihiDUbP4q09","Talk":"Think twice before dropping ACID and throw your CAP away","Tags":["database"],"Year":"2017","Speakers":["recBU9oMnoBejSWPB"]},{"_id":"recW3kbolwQESSm92","Talk":"Get Immersed into a Holographic World with HoloLens","Description":"This talk is an overview of Mixed Reality with HoloLens:\n\t* AR/VR/MR - comparing all kinds of digital realities that are already on the market and how Mixed Reality differs from the others \n\t* HoloLens - hardware and software, capabilities and limitations\n\t* Tools for developers - how development lifecycle looks like and what tools are available\n\t* Building blocks - what are the building blocks of every Mixed Reality app, it's very important to understand as UX is different than whatever user has experienced before\n\t* \n\t\t* Gaze - first form of user's input\n\t\t* Gestures - interaction with holograms\n\t\t* Voice - more intuitive way to interact with holograms\n\t\t* Spatial Sound - giving more presence to holograms\n\t\t* Spatial Mapping - blend real and virtual world together, this is the main thing that makes MR different from the others\n\t\t* Sharing Holograms - share holographic experience between devices\n\n\t*Community - How is community around this technology? Where to get help and resources?\n\t*Future - current and possible uses of the technology, Microsoft plans regarding Windows Mixed Reality. Why is it worth to engage with it?","Tags":["vr/ar"],"Year":"2017","Speakers":["rectoTLNK2TmW4Qyn"]},{"_id":"recWYx5bBGwYm6v3R","Talk":"Beyond Goats & Silos","Description":"A lot has changed since the term DevOps was coined. How has this change in the world of technology impacted the relevance of DevOps as we move towards a Cloud Native world. Are the principles of DevOps still applicable, and how to we go beyond the Goats & Silos of DevOps?","Tags":["devops"],"Year":"2018","Speakers":["recDUaxjg3aEdglrU"]},{"_id":"recWaPxTew8zVbCVs","Talk":"Top 10 Key Performance Techniques for Hybrid mobile Apps","Description":"Don't generate the UI on the server\nLimit network access\nDon't wait for the data to display the UI\nUse hardware acceleration\nAvoid click event's 300ms delay\nOptimize images\nLimit shadows and gradients\nDo you need that framework?\nMinimize browser reflows\nTest\"","Tags":["mobile"],"Year":"2017","Speakers":["reccR0G9VmQVTaAdW"]},{"_id":"recY3TUJK3sZdy7Lz","Talk":"Using Chaos Engineering for Building Resilient Systems","Description":"Chaos Engineering takes the complexity of a distributed system and test it holistically by simulating turbulent conditions and observing how the system responds and performs. The data collected allows to build more resilient applications and improves observability of the system. This talk will provide an introduction to the history, need, and principles of Chaos Engineering. Attendees will learn how to perform Chaos Engineering experiments, collect data, identify the weakness and fix the system. Attendees will learn different tools like Istio, Chaos Toolkit, Kube Monkey and other open source offerings and how to conduct experiments using them.","Tags":["test","cloud"],"Year":"2018","Speakers":["recFppoWowuaK5jdY"]},{"_id":"recYTPU76yzhpfWJy","Talk":"Empathy-Driven design","Tags":["ux"],"Year":"2017","Speakers":["rec0UJKgy78q2O9ca"],"Rating":1},{"_id":"recZUhROLFg3FR0gG","Talk":"Agile in Public Sector","Tags":["project-management"],"Year":"2017","Speakers":["recDtKxa0x8dnecJ5"]},{"2019":["recxSG8kp2ggMGAdF"],"_id":"recaPKjpV9DBTm3AV","Talk":"TEST TEST TEST TEST","Description":"Test talk description\n","Year":"2019","Speakers":["recSIjP2IwePkvfO9"]},{"_id":"recb2q32nRPXbb0ey","Talk":"Musings and Music: Modular Synths and Microservices","Description":"Through a live demonstration of a complex analog synthesizer, I’ll take a deep look at decoupled design, and learnings from Ricardo’s last year of rebuilding - over 400 repositories dozens of services and apps, and a brand-new platform - and my own journey into modular synthesis. A musical and architectural exploration in design, creativity, and emerging standards in a chaotic world.","Tags":["music"],"Year":"2018","Speakers":["rec9GHNEQYVD8dEUW"],"Rating":3},{"_id":"recbDdlbOvGhhwVzU","Talk":"A WebXR whirlwind tour","Description":"In this session we will explore how VR and AR allow us to immerse our users in new experiences and why web technologies are a great way of building such experiences. We will see how to create virtual worlds with HTML and JavaScript, how to work with 3D models, see some examples of the VR web and see what’s out there!","Tags":["vr/ar","web"],"Year":"2018","Speakers":["reco31BkOM9e8mWzQ"]},{"_id":"recblAWzEDp0G3sac","Talk":"The bullet hole misconception","Description":"The bullet hole misconception: In WW2 the military added armour to airplanes where there were most hits, however, only after reinforcing places where airplanes had no hits improved return rates\nBullet holes in our applications: We apply the same thinking to our applications and often ignore the areas where our applications could actually help our uses the most\nPrototypes to reinforce this idea: A self-syncing address book which keeps up with people changing numbers, jobs & addresses, a flight search engine which hooks into your holiday calendar and address book to suggest better places to go and annotations to articles you can share\nOutlook: Where do we need to go to make our technologies and applications more powerful","Tags":["ux"],"Year":"2017","Speakers":["recALem0mEJj5i9Hl"]},{"_id":"recclRPXRV1pPM5Yo","Talk":"A year of mob programming - tips and tricks","Description":"Mob programming is when the whole development team works on the same thing, at the same time, in the same space and with one shared computer. I’ve been working in a development team where we’ve been mob programming for well over a year, every day, without exceptions. We noticed an enormous boost in productivity as we used the team’s overall brain capacity to solve problems and to ship high quality software. But it was not always easy. We’ve learned to master this way of working the hard way, by continuously improving on our processes, which I’ll share in this presentation.\n","Tags":["project-management"],"Year":"2018","Speakers":["recDvxAW6Dbjw4owj"]},{"_id":"reccsGPmjYpBkP5Il","Talk":"OPC UA – ready for Industry 4.0 with open source","Description":"Get ready and stay in control for Industry 4.0. This talk will show how production ready open source projects can help build your OPC UA solution on the device and cloud level.\n\nGet at peek of what is possible and take code home to get started","Tags":["cloud","mobile"],"Year":"2018","Speakers":["recGxzi4gdVtQjPC0"]},{"_id":"reccsuGSBjtiDMpDF","Talk":"When cells lose control - how genomic data is reshaping our understanding of cancer","Year":"2017","Speakers":["recgEbhiMlLmCIy8B"]},{"_id":"receMGyxNMam9ffNM","Talk":"Springing into Kotlin: How to Make the Magic even more Magical","Description":"Developing applications with Spring Boot is already a pretty magical experience, but could it be better? Can the magic get any more powerful than it already is?\n\nIn this talk, we’ll look at how Kotlin can be used to reduce boilerplate, increase code quality, and elevate your wizardry. The presenter will demonstrate how to begin incorporating Kotlin into your existing Spring applications and, once you start your journey, where it can lead.","Tags":["java","kotlin"],"Year":"2018","Speakers":["recf2FsuOWXxqE4Xm"]},{"_id":"receaDIZ0B0guetLj","Talk":"High-Performance Hibernate","Description":"- what are the best identifier generators to use\n- what mappings are not suitable for a data intensive application\n- how statement batching can be enabled and what can compromise its usage\n- flushing best practices\n- bytecode enhancements\n- application-level concurrency control patterns\n- caching best practices and gotchas","Tags":["database"],"Year":"2017","Speakers":["recmUsKsxptb23P0B"]},{"_id":"receb9KwxEs3v4Zam","Talk":"Building Event-Driven Microservices with Event Sourcing and CQRS","Description":"\"1. A bit about Wix and Wix Invoices\n2. First architecture draft\n3. Intro to event sourcing\n4. Intro to CQRS\n5. Final architecture of Wix Invoices\n6. Event sourcing is not a silver bullet- 3 issues to take into account- handling consistency, validations, and concurrent updates in event sourcing and cqrs environment\n7. lessons learned\"","Tags":["cqrs"],"Year":"2017","Speakers":["reccOSuW84JMd8Xbp"]},{"_id":"recfLykYngr5ElhdR","Talk":"Fear: The Driver Behind Our Behavior","Description":"Did you know there are only five root causes of fear? Yep, only five. But those five root causes of fear are real. So real that it drives 80% of our bad behavior. And instead of giving the word the proper respect it deserves, we turn the word into a “cute” Instagram post encouraging the world to simply be fearless. But this isn’t a thing.\n\nWe are born to fear. It’s in our DNA. After all, something has to tell us to run from the tiger. Until we’re willing to actually examine our behaviors when we are afraid, and the root causes we won’t ever be able to “act fearless.”\n\nIn this educational and inspirational presentation we discuss why fear exists, common behaviors of fearful behavior (you’d be surprised at how insidious it is) and what you can do to act despite your fear.\n\nAs an added bonus we talk about how to recognize when others are acting out of fear and how you can open up dialog about fear. Once we’re able to talk about fear it becomes a game changer for our relationships with co-founders, partners, and ourselves.\n\nThis is a practical approach to understanding fear and has helped hundreds of entrepreneurs make huge decisions and leap to the next level.","Tags":["startups"],"Year":"2018","Speakers":["recAWIvBqg7csSCA6"]},{"_id":"rechEK7cs18SGAGkE","Talk":"What if Spring framework disappeared for a week?","Description":"This talk is a bit provocative. Spring framework is probably the most successful of all Java frameworks in the last couple of years. Usually, half of every conference schedule is dedicated to it. It’s really great and helpful, but sometimes I see that (especially younger) developers stop to see world outside it. If they cannot use Spring for some (good or bad) reasons, they are helpless and start to moan. I’d like to do a kind of a mental experiment – what would one do in such a situation, which stuff is really essential and which is such syntax sugar that is easily replaced. This talk is mostly Spring/Java based, but I’d like to make some general observations about frameworks/libraries – how to distinguish if some feature is really difficult to live without, or is it just some syntactic glue we can replace with 5 lines of code.","Tags":["java","dev"],"Year":"2018","Speakers":["rec0KfQxWEl0WLUG7"]},{"_id":"rechKzzWXGKkJfaOv","Talk":"“Zero code” systems - hopes, myths and reality","Tags":["dev"],"Year":"2017","Speakers":["rec0KfQxWEl0WLUG7"]},{"_id":"recipM6OX72LHoNa1","Talk":"Handling complex data with Neo4j","Description":"Today we not only have Big Data, we also have Complex Data. This talk shows how Neo4j - a graph database - is used, with examples from multiple projects where Neo4j is used in combination with Deep Learning resulting in a Knowledge Graph.\n","Tags":["nosql"],"Year":"2017","Speakers":["recGj589NIMwLWCVy"]},{"_id":"recjjyLJvjrLVhhja","Talk":"Technology for a Moving World","Description":"TomTom builds technology for a moving world. We help drivers – human or computer – to drive the 1.2 billion cars in the world safely. Every day, all over the world, moving goods and people where they need to go. In 1984, TomTom started mapping the world for navigation applications that help drivers find their way from A to B, eliminating the need for paper maps. Later, in 2006, we developed global traffic services and connected navigation applications so drivers could outsmart traffic congestion altogether. Currently, we fight range anxiety for drivers navigating in their electric vehicles, making sure they don’t run out of batteries. Going forward, we are already enabling automated vehicles to see beyond their physical sensors by remapping the world with centimeter accuracy. We’re building applications that assist people as they drive, or even drive a car all on its own – more safely and more efficiently than human drivers can.","Tags":["engineering"],"Year":"2018","Speakers":["rec74lT5HMcdcuLTg"]},{"_id":"reckGJZuUb1OjzT7w","Talk":"Programmatic advertising - or who decides what ads I'll see?","Description":"Did you ever wonder how the news site decides which ad to show you?\n\nEnter the world of “Real Time Bidding” where your each page view is auctioned to the highest bidder to provide ads. How does technology work at low level? Who sends what data to whom? How are millions of ads evaluated in under 10ms, at 250k requests/second.","Year":"2018","Speakers":["recYjVxvJg9hyNzXo"]},{"_id":"reckdY9Gmjkprk807","Talk":"Microservices with Kafka","Tags":["microservices"],"Year":"2017","Speakers":["recbB0rDmP7KXf4YL"]},{"_id":"reclEXnWYxXSoS8wZ","Talk":"Replacing a Jet Engine Mid-flight, or How We Launched New Architecture for a Planet-Scale Distributed System at Google","Description":"\"- Build system story: evolution of build system towards distributed builds\n- From push to pull architecture: client/server architecture to services\n- Zero-downtime migration\"","Tags":["engineering"],"Year":"2017","Speakers":["rec8todigwYXvF0ur"]},{"_id":"reclHfwzwUWYKZ4zz","Talk":"Testing in the 21st Century","Description":"Microservices architecture has changed how companies develop and deploy applications. This change has affected testing process as well. New techniques have emerged and others have been enhanced.\n\nCome to this session to learn about service virtualization, contract testing or testing in production to increase deployment velocity from 1 week to N times per day or deploy each service independently without worrying about breaking the compatibility between services anymore.","Tags":["test"],"Year":"2018","Speakers":["recxvA5PjX9MnkD7U"]},{"_id":"recmoXU1PIUWoQakw","Talk":"About your next IoT project with Java and LoRaWAN","Tags":["java","iot"],"Year":"2017","Speakers":["recHlubEhaSsNp5VC"]},{"_id":"recmrc1LjtZ9R5D1S","Talk":"Building on the shoulders of giants","Description":"This talk will cover how Nutanix build a scale-out distributed hyper-converged system using available open source components such as Cassandra, Zookeeper, KVM etc. While these open-source products provide a good a starting point for product development, layers of abstraction and customization eventually leads to having to understand and owning of the sources of these complex products. This talk will share some insights and learnings from our journey at Nutanix.","Tags":["engineering"],"Year":"2018","Speakers":["recU7RjUpuaHamEnN"]},{"_id":"recnLKihRn9uctNjO","Talk":"Migrating to Microservice Databases: From Relational Monolith to Distributed Data","Tags":["microservices"],"Year":"2017","Speakers":["recsK0rRkhkMbc1Jx"]},{"_id":"recnYzSTbEDdBmg4O","Talk":"Application update cycle from a developer’s perspective - Top Eleven case study","Tags":["engineering"],"Year":"2017","Speakers":["rec0o8CsfO33gQ0UY"]},{"_id":"recnZ55t9mznagXA8","Talk":"Artificial intelligence and dumb interfaces","Tags":["ai"],"Year":"2017","Speakers":["recJMk9ZxkPhYkkWO"]},{"_id":"recneGGWL0pXjzbnn","Talk":"From software engineering to software management","Description":"You’re a senior engineer. You decide to switch to management and would like to get the experience of leading a team. How is your role going to change? What challenges are you going to face? How are you planning on keeping up with new technologies? Are people reporting to you going to see you as a leader and follow you?\nManagement varies greatly depending on the organization you belong to - we'll see what Spotify considers good or bad behavior from a manager. Spotify calls the people who directly manage engineers Chapter Leads. Learn what they do on a daily basis and which tools they use within their teams. Discover where the company stands in the discussion of leadership vs management.","Tags":["engineering"],"Year":"2017","Speakers":["recBRuSxrkCyoSDtH"]},{"_id":"recnh9AzCLkhiL0jx","Talk":"Field-tested interfaces for the next billion","Description":"Learn about building products for a different kind of digital landscape than many of us are used to – for the billions of people around the world that now have access to connected smart phones, but who can afford only a few megabytes of data here and there, have cheap, low-powered devices, unreliable electricity, and are learning to use digital interfaces for the first time.\n","Tags":["mobile","engineering"],"Year":"2018","Speakers":["recngMsl1BjyagN4m"],"Rating":3},{"_id":"recpP7tGQ6dJxKxfT","Talk":"How we built Dev.Tube","Description":"Built by 2 developers in only 2 months, Dev.Tube is gradually becoming the primary hub of developer videos.\n\nIn this entertaining but practical session, Eduards – the founder and core developer, will tell what went wrong, what went well and what can we learn from Dev.Tube launch. We’ll cover:\n\n+ how we attracted 1 million monthly visitors\nhow we maintain infrastructure (and how much does it cost $$$)\n+ why experienced java developers ended up writing javascript\n+ why sometimes we do not write unit tests\nhow to make OSS contributors happy (or angry)\n+ how SaaS vendors helped us survive the load (and why)\n\n…and much more!\n\nAfter this session, you’ll be equipped with interesting real-world take-aways. Great mood guaranteed!","Tags":["dev","startups","engineering"],"Year":"2018","Speakers":["recGNToupNDz8gfWF"]},{"_id":"recpvOe75Eusq3oKP","Talk":"Kotlin Social Graph","Tags":["dev","kotlin"],"Year":"2017","Speakers":["recbx9WnZlr9fduwI"]},{"_id":"recqDHjRW3Z0nIR8C","Talk":"A drill-down on Java EE 8!","Description":"The goal of this session is to cover the main enhancement of Java EE 8 with one or two demos.","Tags":["java"],"Year":"2017","Speakers":["rec0sljvDaOpDG63O"]},{"_id":"recqQpRAAWkjM7JDl","Talk":"The Engineering-Manager Transition","Description":"From mentoring team members to aligning engineering efforts with business priorities, today’s companies are in dire need of great technical leaders. There is no management school for this and most organizations lack access to guidance or a mentorship framework that can transition their most talented core contributors into contemporary engineering managers. This talk will share tactics for using an engineer’s natural pattern-matching skills within a framework for dealing with the situationally complex problems that arise within growing modern technical teams.","Tags":["project-management"],"Year":"2018","Speakers":["recYM0uwGXExC1gge"]},{"_id":"recqs823gBzELuws3","Talk":"Spanner - a fully managed horizontally scalable relational database with ACID transactions that speaks SQL","Tags":["database"],"Year":"2017","Speakers":["receXU7Q0eKYjoAHR"]},{"_id":"recrEZ09GRy5fTn1w","Talk":"iOS-Factor: A methodology for building high-quality iOS apps on a solid architecture","Description":"Felix will talk about how iOS development processes have changed over the last 10 years, and how you can apply more up-to-date engineering practices into your daily development workflow. This includes Continuous Integration and Delivery, clean declarations of dependencies, automation of repeating workflow as well as automated app versioning.","Tags":["mobile","ios"],"Year":"2018","Speakers":["recrzdpU2nic9WD0K"],"Rating":3},{"_id":"recrVCnqXzgfdPMY3","Talk":"Hacking Web Performance","Description":"New compression algorithms? New image formats? Client Hints? HTTP/2 push? Let’s hack Web Performance. I’ll briefly cover the important steps that most web professionals are making to improve performance. We’ll get deeply into what’s new and extreme that can increase radically user’s perception and conversion thanks to a better performance - new image formats, protocols, compression algorithms and a review of old ideas. This talk is based on a research presented in my recent ebook .","Tags":["web","dev"],"Year":"2018","Speakers":["recxWXpRq1ueyPmqV"]},{"_id":"recrlXapJAqvLlzGj","Talk":"What I learned about Serverless from building a Pokémon Radar","Description":"In 2017 I had been playing Pokémon on and off for about a year and had a few left to catch! Though pokemon tracking maps helped, I wondered, what if THE pokemon I wanted popped up when I wasn’t looking? So I set out to build a service that would send me push notifications every time there was an important pokemon around. I had a few constraints. Whatever I built had to:\n\nBe free: I have one rule with this game, and it’s to never spend money on it. Paying a cent to build this was off-limits.\nBe reliable: The goal of this service was to make sure I never missed a pokemon I cared about. That meant no downtime.\nNot overwhelm external dependencies\nBe performant\nIn this talk I share how I built this service: how, to meet those constraints, it went from a free Heroku app with a scheduler to a serverless system with lambdas running in 7 different parts of the world. We’ll also go over how this experience shaped real-life decisions in my team at The Financial Times, where speed, reliability and cost play a big role in our architectural decisions.","Tags":["serverless"],"Year":"2018","Speakers":["recstoIr3GAuduEnR"]},{"_id":"recsTMUVCzW8L4TRX","Talk":"Cloud scale IoT messaging","Description":"Device connectivity is one of the most common issues IoT developers need to solve. Having an open source solution based on the standardized protocols that solves recurring connectivity problems is a very useful tool to have.\n\nMeet Eclipse Hono, a cloud-based IoT connectivity platform which provides remote interfaces for device connectivity and mechanisms for uniform interaction with devices regardless of the communication protocol.","Tags":["iot","cloud"],"Year":"2018","Speakers":["recZc8742BSsZjo9Y"]},{"_id":"recsW8u7bHfmJR9SY","Talk":"Challenges in Implementing MicroServices","Description":"● Defining micro-services in a manner that tends to be smaller than most\n● Introducing an asynchronous architecture well-suited for micro-services, and more importantly, for dynamic business environments (including an animation of the process in action)\n● Summarizing the experiences at three different companies in three different businesses (Web-based sales, online newspaper, and optimization engines for Fortune 100 companies)\n● Suggesting co-requisite technologies and process that enable/facilitate micro-services\n● Discussing 7 or 8 different challenges that face implementers that we have identified so far\"","Tags":["microservices"],"Year":"2017","Speakers":["recvYOL9pASfohqED"]},{"_id":"recseGk2EBqMHn8lO","Talk":"Decomposing Java applications","Description":"Most Java developers happily use libraries in their applications. Many developers split their own code into what they call modules hoping that brings benefits. Yet way too often they end up having a (distributed?) big ball of mud sooner or later? This session aim to answer the question: why simply cutting things down into smaller pieces and calling them libraries, modules, microservices, … does not work?\n\nIn this talk we’ll go one abstraction level above and look at the process of decomposing a Java application into reusable components. We’ll examine different ways to organize Java code in methods, classes, packages and modules. We’ll talk about APIs, SPIs, hiding implementation details and enforcing module boundaries. Some of you will be surprised how well SOLID principles fits into the picture. But most important of all, we’ll end up with application design that has good chance to evolve over the years without introducing additional accidental complexity.","Tags":["java","modules","dev"],"Year":"2018","Speakers":["recAep1LAE7jxX0yQ"]},{"_id":"rect4pULIcmRdKdC0","Talk":"Monorepos and Microservices: Together at Last","Tags":["microservices"],"Year":"2017","Speakers":["recdkuXKjEiyggnIe"]},{"_id":"recw7ugUvJ1fgSC6q","Talk":"Making great, discoverable web apps","Description":"The web is a great platform, but making web apps fast, semantic and discoverable can be a challenge. In this session we will explore how to build web apps that work great for your users and can be found better via search engines, too. We will discuss PWAs, technical SEO, server side rendering and a few other bits and pieces for you to build successful web apps.","Tags":["web"],"Year":"2018","Speakers":["reco31BkOM9e8mWzQ"]},{"_id":"recwCV8ios1anuRCs","Talk":"Pragmatic Architect","Tags":["engineering"],"Year":"2017","Speakers":["rec4JTs6AU6iFbKQw"],"Rating":2},{"_id":"recwFUGeMRBXTIQ7H","Talk":"Starting a company, growing from 3 to 300 people, and selling","Description":"How the company changed as it went through the various stages of growth (startup, rapid growth, maturing into a “real” company, and finally selling), including the positive things and the challenges about each stage. How we overcame the various challenges and use some funny true stories from our past to illustrate some of the issues we faced. I’d give some tips on starting and growing a company in general.","Tags":["startups"],"Year":"2018","Speakers":["rec9UIGs9j0QeYjih"]},{"_id":"recxAV95o3gm9bW9x","Talk":"Building your own VR+AR experiences in Web based virtual reality","Tags":["vr/ar","web"],"Year":"2017","Speakers":["recHCQQNzV42RvKm4"]},{"_id":"recxOY2GbV4vN605k","Talk":"Uncovering the secrets of Progressive Web Apps","Description":"We’ll introduce the current state of PWAs, available platforms, compatibility, business and technical challenges. We will get deep into the Android’s WebAPK system and we will see how to increase installation rates through banners and dialog APIs, and what happens after the PWA was installed and the user encounters a link to our web server.\n\nWe will talk about how to get our PWA into stores, including official support on Microsoft Store, the usage of Web Trusted Activites for Android’s Play Store and solutions for iOS and mac AppStore, including the new Capacitor framework to create native PWAs.","Tags":["web","dev"],"Year":"2018","Speakers":["recxWXpRq1ueyPmqV"]},{"_id":"recy762k1MyKbGpR1","Talk":"Scaling Data In The Cloud","Description":"One of the great things about cloud deployments is the easy scaling. You might run your application on multiple machines, changing the number of machines up and down perhaps through a PAAS engine marshalling an IAAS provider.\n\nThis is all fine for processing, but what about data stores?\n\nIf these are hosted on a single server, this quickly becomes a bottleneck that limits the ability for the processing to deliver on the scaling promise.\n\nIn this talk we’ll look at Hazelcast in-memory data grid (IMDG), and how this can distribute and re-distribute data records evenly across multiple hosts. Now data can scale as easily as processing. Problem solved!\n\nWell, not quite. There are a few irritating details to be aware of, so we’ll end this talk with a demo of Hazelcast data-grid running on some providers, to see how the problems manifest and how they are solve.","Tags":["cloud"],"Year":"2018","Speakers":["recsHOByqr5Waz0YK"]},{"_id":"recyOZyfoYIJgikpO","Talk":"Are we all doomed and what can we do about it?","Year":"2017","Speakers":["recDjzNIqYjBDFw0b"]},{"_id":"recycmJdPXd3NyGyV","Talk":"Light up your microservices with the Serverless Framework","Tags":["microservices","serverless"],"Year":"2017","Speakers":["recPnDqCgbMa1QCui"]},{"_id":"reczPkV8aqrhMnfH1","Talk":"More Than Music: Tiny Computers, JavaScript and MIDI","Tags":["javascript"],"Year":"2017","Speakers":["recgLkbRe3fcsugxz"]}]